pynfse/src/integration/carnaubal/abrasf/templates/base.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://www.abrasf.org.br/ABRASF/arquivos/nfse.xsd">
	<soapenv:Header />
	<soapenv:Body>	
        <nfse:RecepcionarLoteRps>
            <header><![CDATA[
                <cabecalho xmlns="http://ws.speedgov.com.br/cabecalho_v1.xsd" versao="1">
                    <versaoDados xmlns="">1</versaoDados>
                </cabecalho>
            ]]></header>

            <parameters><![CDATA[
				{{ soap_body }}
            ]]></parameters>
        </nfse:RecepcionarLoteRps>

	</soapenv:Body>
</soapenv:Envelope>
