pynfse/integration/carnaubal/abrasf/reference/envio_lote.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:nfse="http://www.abrasf.org.br/ABRASF/arquivos/nfse.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <nfse:RecepcionarLoteRps>
            <header><![CDATA[
                <cabecalho xmlns="http://ws.speedgov.com.br/cabecalho_v1.xsd" versao="1">
                    <versaoDados xmlns="">1</versaoDados>
                </cabecalho>
            ]]></header>
            <parameters><![CDATA[
<EnviarLoteRpsEnvio xmlns="http://ws.speedgov.com.br/enviar_lote_rps_envio_v1.xsd">
    <LoteRps xmlns="" Id="lote_001">
        <NumeroLote>1</NumeroLote>
        <Cnpj>12215750000593</Cnpj>
        <InscricaoMunicipal>326907</InscricaoMunicipal>
        <QuantidadeRps>1</QuantidadeRps>
        <ListaRps>
            <Rps>
                <InfRps Id="rps_001">
                    <!-- IDENTIFICAÇÃO DO RPS -->
                    <IdentificacaoRps>
                        <Numero>100</Numero>
                        <Serie>A1</Serie>
                        <Tipo>1</Tipo>
                    </IdentificacaoRps>

                    <!-- DADOS BÁSICOS -->
                    <DataEmissao>2025-12-05T10:30:00</DataEmissao>
                    <NaturezaOperacao>1</NaturezaOperacao>
                    <RegimeEspecialTributacao>1</RegimeEspecialTributacao>
                    <OptanteSimplesNacional>2</OptanteSimplesNacional>
                    <IncentivadorCultural>2</IncentivadorCultural>
                    <Status>1</Status>

                    <!-- SERVIÇO -->
                    <Servico>
                        <Valores>
                            <ValorServicos>10000.00</ValorServicos>
                            <ValorDeducoes>500.00</ValorDeducoes>
                            <ValorPis>65.00</ValorPis>
                            <ValorCofins>300.00</ValorCofins>
                            <ValorInss>1100.00</ValorInss>
                            <ValorIr>150.00</ValorIr>
                            <ValorCsll>100.00</ValorCsll>
                            <IssRetido>1</IssRetido>
                            <ValorIss>475.00</ValorIss>
                            <ValorIssRetido>475.00</ValorIssRetido>
                            <OutrasRetencoes>50.00</OutrasRetencoes>
                            <BaseCalculo>9500.00</BaseCalculo>
                            <Aliquota>0.0500</Aliquota>
                            <ValorLiquidoNfse>7260.00</ValorLiquidoNfse>
                            <DescontoCondicionado>100.00</DescontoCondicionado>
                            <DescontoIncondicionado>200.00</DescontoIncondicionado>
                            <!-- 🆕 CAMPOS NOVOS PIS/COFINS -->
                            <CSTPisCofins>01</CSTPisCofins>
                            <BaseCalculoPisCofins>9500.00</BaseCalculoPisCofins>
                            <TipoRetencaoPisCofins>1</TipoRetencaoPisCofins>
                        </Valores>
                        <ItemListaServico>01.01</ItemListaServico>
                        <CodigoCnae>6201501</CodigoCnae>
                        <CodigoTributacaoMunicipio>010100</CodigoTributacaoMunicipio>
                        <Discriminacao>Desenvolvimento de software personalizado.</Discriminacao>
                        <CodigoMunicipio>3550308</CodigoMunicipio>
                    </Servico>

                    <!-- PRESTADOR -->
                    <Prestador>
                        <Cnpj>12345678000199</Cnpj>
                        <InscricaoMunicipal>12345</InscricaoMunicipal>
                    </Prestador>

                    <!-- TOMADOR -->
                    <Tomador>
                        <IdentificacaoTomador>
                            <CpfCnpj>
                                <Cnpj>98765432000188</Cnpj>
                            </CpfCnpj>
                            <InscricaoMunicipal>54321</InscricaoMunicipal>
                        </IdentificacaoTomador>
                        <RazaoSocial>CLIENTE EXEMPLO LTDA</RazaoSocial>
                        <Endereco>
                            <Endereco>Avenida Paulista</Endereco>
                            <Numero>1000</Numero>
                            <Complemento>Sala 1501</Complemento>
                            <Bairro>Bela Vista</Bairro>
                            <CodigoMunicipio>3550308</CodigoMunicipio>
                            <Uf>SP</Uf>
                            <Cep>01310100</Cep>
                        </Endereco>
                        <Contato>
                            <Telefone>11999999999</Telefone>
                            <Email>contato@cliente.com.br</Email>
                        </Contato>
                    </Tomador>

                    <!-- INTERMEDIÁRIO (com campos expandidos) -->
                    <IntermediarioServico>
                        <RazaoSocial>INTERMEDIADOR LTDA</RazaoSocial>
                        <CpfCnpj>
                            <Cnpj>11222333000144</Cnpj>
                        </CpfCnpj>
                        <InscricaoMunicipal>99999</InscricaoMunicipal>
                        <!-- 🆕 CAMPOS NOVOS -->
                        <TipoLogradouro>RUA</TipoLogradouro>
                        <Endereco>Rua das Flores</Endereco>
                        <Numero>250</Numero>
                        <Complemento>Conjunto 10</Complemento>
                        <Bairro>Jardins</Bairro>
                        <CodigoMunicipio>3550308</CodigoMunicipio>
                        <UF>SP</UF>
                        <CEP>01234567</CEP>
                        <Email>inter@empresa.com.br</Email>
                    </IntermediarioServico>

                    <!-- CONSTRUÇÃO CIVIL -->
                    <ConstrucaoCivil>
                        <CodigoObra>OBR2025001234</CodigoObra>
                        <Art>ART12345678901</Art>
                    </ConstrucaoCivil>

                    <!-- ================================================ -->
                    <!-- 🆕 BLOCOS NFS-e NACIONAL (TODOS NOVOS) -->
                    <!-- ================================================ -->

                    <!-- 🆕 DadosDPS -->
                    <DadosDPS>
                        <TpEmit>1</TpEmit>
                        <TpAmb>1</TpAmb>
                        <DhEmi>2025-12-05T10:30:00</DhEmi>
                        <VerAplic>1.0.0</VerAplic>
                        <CLocEmi>3550308</CLocEmi>
                        <CLocPrestacao>3550308</CLocPrestacao>
                        <CTribNac>010101</CTribNac>
                        <TribIssqn>1</TribIssqn>
                        <TpRetIssqn>1</TpRetIssqn>
                        <OpSimpNac>1</OpSimpNac>
                        <RegEspTrib>0</RegEspTrib>
                        <RegApTribSN>1</RegApTribSN>
                    </DadosDPS>

                    <!-- 🆕 DadosObra -->
                    <DadosObra>
                        <CodigoObra>CNO12345678901234567890</CodigoObra>
                        <InscImobFisc>INSCIMOB123456789012345</InscImobFisc>
                        <EnderecoObra>
                            <Cep>01310100</Cep>
                            <Logradouro>Avenida Paulista</Logradouro>
                            <Numero>1500</Numero>
                            <Complemento>Terreno A</Complemento>
                            <Bairro>Bela Vista</Bairro>
                        </EnderecoObra>
                    </DadosObra>

                    <!-- 🆕 ComercioExterior -->
                    <ComercioExterior>
                        <MdPrestacao>1</MdPrestacao>
                        <VincPrest>0</VincPrest>
                        <TpMoeda>220</TpMoeda>
                        <VServMoeda>2000.00</VServMoeda>
                        <MovTempBens>0</MovTempBens>
                        <MDIC>0</MDIC>
                        <CPaisResult>1058</CPaisResult>
                    </ComercioExterior>

                    <!-- 🆕 ExigibilidadeSuspensa -->
                    <ExigibilidadeSuspensa>
                        <TpSusp>1</TpSusp>
                        <NProcesso>0001234-56.2025.8.26.0100</NProcesso>
                    </ExigibilidadeSuspensa>

                    <!-- 🆕 BeneficioMunicipal -->
                    <BeneficioMunicipal>
                        <TpBM>1</TpBM>
                        <NBM>12345678901234</NBM>
                        <VRedBCBM>1000.00</VRedBCBM>
                        <PRedBCBM>10.00</PRedBCBM>
                    </BeneficioMunicipal>

                    <!-- 🆕 ReembolsoRepasse -->
                    <ReembolsoRepasse>
                        <TpReembRepRes>1</TpReembRepRes>
                        <XTpReembRepRes>Reembolso de despesas</XTpReembRepRes>
                        <VReembRepRes>500.00</VReembRepRes>
                    </ReembolsoRepasse>

                    <!-- 🆕 Destinatario -->
                    <Destinatario>
                        <CnpjCpf>55566677788899</CnpjCpf>
                        <Nome>DESTINATARIO FINAL LTDA</Nome>
                        <Logradouro>Rua do Destinatario</Logradouro>
                        <Numero>789</Numero>
                        <Complemento>Andar 5</Complemento>
                        <Bairro>Centro</Bairro>
                        <Cidade>Sao Paulo</Cidade>
                        <UF>SP</UF>
                        <CEP>01000000</CEP>
                        <CodMunicipio>3550308</CodMunicipio>
                        <CodPais>1058</CodPais>
                        <Email>dest@empresa.com.br</Email>
                        <Telefone>11988887777</Telefone>
                    </Destinatario>

                    <!-- 🆕 ControleIBSCBS -->
                    <ControleIBSCBS>
                        <FinNFSe>0</FinNFSe>
                        <IndFinal>1</IndFinal>
                        <TpOper>1</TpOper>
                        <TpEnteGov>0</TpEnteGov>
                        <IndDest>0</IndDest>
                        <CIndOp>000001</CIndOp>
                    </ControleIBSCBS>

                    <!-- 🆕 IBSCBS -->
                    <IBSCBS>
                        <IBSCBSBaseCalculo>9500.00</IBSCBSBaseCalculo>
                        <IBSUFAliquota>9.50</IBSUFAliquota>
                        <IBSMunAliquota>3.50</IBSMunAliquota>
                        <CBSAliquota>8.80</CBSAliquota>
                        <IBSUFValor>902.50</IBSUFValor>
                        <IBSMunValor>332.50</IBSMunValor>
                        <CBSValor>836.00</CBSValor>
                        <IBSUFPercReducao>0.00</IBSUFPercReducao>
                        <IBSMunPercReducao>0.00</IBSMunPercReducao>
                        <CBSPercReducao>0.00</CBSPercReducao>
                        <IBSUFAliquotaEfetiva>9.50</IBSUFAliquotaEfetiva>
                        <IBSMunAliquotaEfetiva>3.50</IBSMunAliquotaEfetiva>
                        <CBSAliquotaEfetiva>8.80</CBSAliquotaEfetiva>
                        <IBSValorTotal>1235.00</IBSValorTotal>
                        <ValorTotalComTributos>12071.00</ValorTotalComTributos>
                        <LocalidadeIncidenciaCod>3550308</LocalidadeIncidenciaCod>
                        <LocalidadeIncidenciaNome>Sao Paulo - SP</LocalidadeIncidenciaNome>
                    </IBSCBS>

                    <!-- 🆕 DataCompetencia -->
                    <DataCompetencia>2025-12-01</DataCompetencia>

                </InfRps>
            </Rps>
        </ListaRps>
    </LoteRps>
</EnviarLoteRpsEnvio>
            ]]></parameters>
        </nfse:RecepcionarLoteRps>
    </soapenv:Body>
</soapenv:Envelope>
